---
kind: method
id: M:Autodesk.Revit.DB.Structure.StructuralConnectionHandler.IsDetailed
source: html/218fb7c4-0752-74ea-2403-82f24b235e00.htm
---
# Autodesk.Revit.DB.Structure.StructuralConnectionHandler.IsDetailed Method

Checks if Structural Connection Handler has the detailed connection style.

## Syntax (C#)
```csharp
public bool IsDetailed()
```

## Returns
True if Structural Connection Handler has the detailed connection style.